[
  {
    "post_id": 3,
    "title": "Funding announcement",
    "description": "<p>Today I’m very excited to announce that SKAEL has received a Seed funding round of $4.1M to help bring our platform for creating and deploying digital employees to market. Some really great Seed investing firms including Bonfire Ventures, Daher Capital, Backend Capital, RIDE Ventures, StratMinds VC, Buffalo Ventures and others participated in this round.</p><p>When you think of fulfilling work, what comes to mind? Chances are, logging into an application, searching through a bunch of documents, analyzing another pivot table, and blankly staring at some slides or another dashboard would not fall anywhere near fulfilling. Yet the majority of us spend up to 6 hours a day, and the most of our working lives doing just that.</p><p>Boring, repetitive, monotonous, drudgery.</p><p>We've tried to solve this problem by buying the latest software application, promising Utopia if we moved every little piece of data to their stack, to end up with unwieldy data silos. We've undergone massive data transformation projects, only to find that our data will never be clean or always in one place. We've even tried dashboarding tools, needing to be customized every time there's another question from the business. And so we've resorted to hiring a mountain of people, just because the time to value just isn't there, transferring our misery to someone else.</p><p>We want to keep everyone informed, and we need the answers backed by our data, but we just want to do them on our terms and get back to the really fulfilling stuff. An email, text, or direct message will work just fine.</p><p>A few organizations have attempted some level of automation. Workflow and RPA being the most common. These systems work well when it's just applications talking to applications, but most organizations need people, and systems that aren't adopted around your users and enabling people to work on their terms are just transferring the unfulfilling nature of work from one group of people to another.</p><p>It was time to end the cycle, so we decided to do things differently at SKAEL. Our user-centric approach to automation helps organizations design and deploy Digital Employees. Your human employees communicate with digital employees in the same way they are accustomed to communicating within your organization: email, text, messaging or voice. No new tools, no new applications, no new dashboards. We don’t store any of your data, we don’t make any third party calls out, everything is patented and built in-house.</p><p>Digital Employees understand what you're asking for and the associated context, they can read attachments, connect across your applications and documents and enable you to store, retrieve, collate, and analyze in seconds. Effectively removing the majority of those repetitive, mundane, unfulfilling tasks. Allowing you to focus back on those things that you classify as most fulfilling.</p><p>With this Seed funding round, we will build and deliver to market a set of Digital Employees that are geared around specific common use cases within different company functions: Finance, IT, Sales Operations and Human Resources to start. We also will be able to work with companies to build out customized Digital Employees for more complex scenarios. Over time based on the market need and customer feedback we’ll add more Digital Employees covering different parts of the business.  We hope that in the future workers within any company will be able to choose different Digital Employees from SKAEL to help them with their day-to-day work, just like they choose to use different tools to get things done today.</p>",
    "image": "/images/news/funding.png",
    "created": "Oct. 29, 2020"
  },
  {
    "post_id": 2,
    "title": "Human Resources: navigating the “new normal” of employee experience and support with digital HR employees",
    "description": "<p>There are three common refrains about the Human Resources (HR) function:</p><ol><li>HR is an administrative cost center</li><li>HR is bureaucratic and inefficient and needs to start adding value to the business</li><li>HR needs to become a true business partner, especially in these challenging times</li></ol><p>Every modern business wants their HR team to be more agile, efficient, proactive, creative, and adaptable to change. As a seasoned HR executive, I wholeheartedly agree. However, if you want HR to come to the table, you need to invest in upgrading capabilities - not just in terms of the HR talent you employ, but also in HR modernization and technology.</p><p>To be honest, this doesn’t solely apply to the HR department, but also to many of the back-office and front-office functions within an organization. Of course, business leaders become immediately concerned about expansive and expensive investments in technology infrastructure solutions, such as ERPs, CRMs, and HRIS, but that’s not what I’m referring to. Yes, every HR department dreams of a kick-ass HR Information System (HRIS) because having immediate access to the right HR data is mission critical for crucial decision-making. I believe a new and better path forward is finding a way to derive a competitive advantage from your current infrastructure and teams, and fundamentally changing the way HR works.</p><p>The biggest challenge HR teams currently face is employee engagement as workers try and adapt to the “new normal.” Gallup recently reported the most significant drop recorded in their history of tracking employee engagement in the U.S., dating back to 2000.</p><p>As a result, HR is increasingly concerned with the ability to scale while providing time-effective and quality support, intensified by the current global crisis and the profound uncertainties that have led to an ever changing work environment. It’s difficult to find an area that hasn’t seen huge change. How we work, where we work, the employee experience, the nature of collaboration, the work itself-- all of these shifts constitute both a challenge and an opportunity. While faced with increasing requests for HR support, creative employment solutions and programs are competing for focus and attention. Questions linger and aren’t adequately addressed: How do we link people to performance and results? How do we upskill our workforce to deal with both current and future challenges? How do we connect our managers with their teams, teams with each other, and with the organization overall now that there is limited personal interaction? How is the engine of the organization acting and performing?</p><p>In order to address some of these key organizational questions,  HR teams need to free up time from dealing with routine HR tasks. We need to derive value from HR competencies and well-crafted HR policies and programs to enhance employee engagement and growth, safeguard shareholder value and comply with laws that protect people, resources, and companies. It’s the emotional and cognitive ability of HR professionals, their capacity for empathy, questioning, listening, coaching, guiding, interpreting and analyzing, that give organizations a competitive edge.</p><p>First, we must understand that there is a difference in types of data and information. There’s data to inform and there’s data to prescribe, predict, describe, interpret. Data to inform is most often related to routine HR queries and requests, such as “How do I add my partner to our benefits system?”, “How do I change my direct deposit?”, “Where can I find our leave policies?”, and of course the classic forgotten password login challenges. In my experience these routine tasks can take up 20-40% of HR time, if not more.</p><p>Second, we must fully appreciate that the value-add for HR lies in focusing on finding solutions to complex people-related needs and issues and in understanding people - how they connect, how they work, how they think and feel, what motivates and engages them.</p><p>Third, we want to ensure that the employee experience improves. In uncertain times, people have a higher need for fast, accurate responses to questions and quality information on demand. The employee experience is directly correlated with employees’ interactions and exposure to HR – its people, its processes and its programs.</p><p>How do we relieve your HR professionals from the time-consuming repetitive tasks, the inefficient processes and the endless request for information and support? HR technologies can facilitate organizational agility and automate processes to some extent. We often also try to find ways to simplify processes, eliminate obsolete tasks, and make information more readily centrally available. Even then, this is often insufficient.</p><p>During a recent virtual seminar on HR.Com, Jason Averbook, CEO of Leapgen, beautifully pointed out that we need to let machines do the performing part, the hands part, and let HR do the head and heart part. Let HR create the things that drive competitive differentiation. Let HR focus more on the 99% and less on the 1%. Let HR think about how to enable experiences, communications and capabilities that have the biggest impact. Transactions don’t drive experiences; therefore, systems need to eliminate the hands work so that HR can focus on the heads and hearts work.</p><p>In order to address the challenges of automation while still focusing on the “human” part of HR,  a revolutionary solution has been recently developed that is gaining momentum: Digital HR Employees. By scaling up the HR team with digital HR employees, the digital colleagues can take care of executing standardized HR processes (e.g. onboarding, offboarding tasks), and answering routine and often recurring questions for information or support, freeing up HR to tap into their irreplaceable human skills and knowledge.</p><p>SKAEL’s Digital Employees specialize in eliminating drudgery and super-powering your human employees by upscaling your teams with digital counterparts that seamlessly integrate with and use your current infrastructure, information repositories and methods of communication. Digital Employees are super-quick to onboard, are self-learning and will provide your human employees with instant, consistent, and accurate support and information, while ensuring all continuity, safety and security requirements are honored. Their processing ability and response rates are unparalleled and they’re always available. Additionally, it comes with built-in instant analytics. A digital employee is more than a bot and not designed to replace your HR team; rather, they complement and super-power the team to become agile, resilient, efficient and able to provide unique value to the organization. That’s something every HR team should be able to get behind!</p><p>Ready to get started with your first Digital Employee? Sign-up now.</p>",
    "image": "/images/news/hr.png",
    "created": "Oct. 22, 2020"
  },
  {
    "post_id": 1,
    "title": "Matt Cooley joins SKAEL as President and Chief Operating Officer",
    "description": "<h2>Former New Relic, Citrix and Salesforce executive to lead SKAEL operational and growth strategy.</h2><p>San Francisco, September 24 - SKAEL, the San Francisco-based technology company offering the leading automation platform for creating and deploying digital employees, announced Matt Cooley has joined the company as President and Chief Operating Officer. Reporting to CEO Baba Nadimpalli, Cooley is responsible for the company’s operational and growth strategy.</p><p>SKAEL’s vision is to help people work smarter by intelligently combining human and digital employees to build a more efficient and happier modern workforce. Established in 2016, the company has 26 employees and has received investment totalling $4.1M from firms including Bonfire Ventures, Daher Capital, Backend Capital, RIDE Ventures, StratMinds VC, Buffalo Ventures and others.</p><p>Matt Cooley is a veteran SaaS leader with a focus on scaling early stage technology businesses. As a member of the initial leadership team at New Relic, Cooley built and managed the global sales team, driving the company from $0 to $100M in revenue which in turn led to a multi-billion dollar initial public offering in 2014. Most recently Matt served as Chief Revenue Officer at Quip, which was acquired by Salesforce for $750M in 2016. Cooley has also led go-to-market organizations at Citrix Systems and at Mixpanel.</p><p>“I am very excited to join SKAEL,” said Cooley. “At SKAEL I see strong similarities to the early days of New Relic, namely a great combination of powerful technology and super smart team in a new, fast-growing market. SKAEL has a great opportunity to become one of the leading hyperautomation companies and I look forward to serving as a leader on this journey.”</p><p>“In a very short timeline SKAEL has built a technology platform that enables our customers to help their people work smarter by automating repetitive, time-consuming tasks,” said Nadimpalli. “Matt’s leadership experience and growth mindset are exactly what I’m looking for at SKAEL as we embark on a period of rapid expansion and success.”</p><h2>About SKAEL</h2><p>SKAEL’s mission is to deliver better user - centric outcomes through intelligent cognitive automation, empowering a synergistic human digital workforce. The company's unique Digital Employee technology maps to any organization’s existing processes, onboarding and completing tasks in minutes. The company has been headquartered in San Francisco since its founding in 2016.</p><p>To learn more about SKAEL, please visit <a href=\"https://skael.com\">skael.com</a> or <a href=\"https://twitter.com/skaelinc\">follow us</a> on Twitter.</p>",
    "image": "/images/news/cooley1.png",
    "created": "Sep. 24, 2020"
  }
]